BasaDip/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридичесикйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьEMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Программы</name>
    <attributes>
      <name>Программа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BasaDip/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EMailКонтрагента</name>
      <description>E mail контрагента</description>
    </items>
    <items>
      <name>ПочтовыйАдресКонтрагента</name>
      <description>Почтовый адрес контрагента</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ФактическийАдресКонтрагента</name>
      <description>Фактический адрес контрагента</description>
    </items>
    <items>
      <name>ЮридическийАдресКонтрагента</name>
      <description>Юридический адрес контрагента</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

BasaDip/src/Catalogs/Контрагенты/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции
	
Процедура ЗаполнитьТабличнуюЧастьКонтактнаяИнформация() Экспорт
	
	Выборка = Справочники.Контрагенты.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекКонтрагент = Выборка.Ссылка.ПолучитьОбъект();
		ТекКонтрагент.КонтактнаяИнформация.Очистить();
		Если ЗначениеЗаполнено(ТекКонтрагент.УдалитьEMail) Тогда
			Стр = ТекКонтрагент.КонтактнаяИнформация.Добавить();
			Стр.Вид = Справочники.ВидыКонтактнойИнформации.EMailКонтрагента;
			Стр.Значение = ТекКонтрагент.УдалитьEMail;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекКонтрагент.УдалитьТелефон) Тогда
			Стр = ТекКонтрагент.КонтактнаяИнформация.Добавить();
			Стр.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			Стр.Значение = ТекКонтрагент.УдалитьТелефон;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекКонтрагент.УдалитьФактическийАдрес) Тогда
			Стр = ТекКонтрагент.КонтактнаяИнформация.Добавить();
			Стр.Вид = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;
			Стр.Значение = ТекКонтрагент.УдалитьФактическийАдрес;
		КонецЕсли;
		
		 Если ЗначениеЗаполнено(ТекКонтрагент.УдалитьЮридичесикйАдрес) Тогда
			Стр = ТекКонтрагент.КонтактнаяИнформация.Добавить();
			Стр.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагента;
			Стр.Значение = ТекКонтрагент.УдалитьЮридичесикйАдрес;
		КонецЕсли;
		
		ТекКонтрагент.Записать();
	КонецЦикла;
	
КонецПроцедуры
 
 #КонецОбласти
